---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.IsCellOverridden(System.Int32,System.Int32)
source: html/0af66dcc-ff3c-1b16-fa0b-5045dec9515d.htm
---
# Autodesk.Revit.DB.TableSectionData.IsCellOverridden Method

Indicates if the cell is overridden or not.

## Syntax (C#)
```csharp
public bool IsCellOverridden(
	int nRow,
	int nCol
)
```

## Parameters
- **nRow** (`System.Int32`)
- **nCol** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given row number nRow is invalid.
 -or-
 The given column number nCol is invalid.